from django.db import models
from django.utils.translation import gettext_lazy as _


class PersonTypeSocialNetworkChoices(models.Model):
    type = models.CharField(max_length=32, verbose_name='Тип')

    time_create = models.DateTimeField(auto_now_add=True)
    time_update = models.DateTimeField(auto_now=True)

    def __str__(self):
        return self.type


class StatusPersonPostChoices(models.TextChoices):
    INCOMING = 'INCOMING', _('Incomings')
    FOR_MODERATION = 'FOR_MODERATION', _('For moderation')
    FORCHECK = 'FORCHECK', _('For check')
    PUBLISHED = 'PUBLISHED', _('Published')
    PROCESSING = 'PROCESSING', _('Processing')
    DELETED = 'DELETED', _('Deleted')
    BEFORE_2022 = 'BEFORE_2022', _('Died before 2022')


class StatusPersonPostPublished(models.TextChoices):
    PUBLISHED = 'PUBLISHED', _('Published')
    NOTPUBLISHED = 'NOTPUBLISHED', _('Not published')    


class StatusPersonChoices(models.TextChoices):
    ALIVE = 'ALIVE', _('Alive')
    CAPTIVITY = 'CAPTIVITY', _('Captivity')
    DIE = 'DIE', _('Die')   
    MISSING_PERSON = 'MISSING_PERSON', _('Missing person')


class ArmyTypeChoices(models.TextChoices):
    T_0 = '00', _('')
    LAND_FORCE = 'Сухопутные войска', _('Сухопутные войска')
    AIR_FORCE = 'Воздушно-космические силы', _('Воздушно-космические силы')
    FLEET_FORCE = 'Военно-Морской Флот', _('Военно-Морской Флот')
    ROCKET_FORCE = 'Ракетные войска стратегического назначения', _('Ракетные войска стратегического назначения')
    AIR_ARMY = 'Воздушно-десантные войска', _('Воздушно-десантные войска')
    NACIONAL_FORCE = 'Войска национальной гвардии Российской Федерации',\
                     _('Войска национальной гвардии Российской Федерации')
    COMPANY_ARMY = 'ЧВК', _('ЧВК')
    POLICE = 'МВД', _('МВД')
    OTHER = 'Другие подразделения МО РФ', _('Другие подразделения МО РФ')
    ILLEGAL_FORMATIONS = 'Незаконные вооружённые формирования.', _('Незаконные вооружённые формирования')


class ArmyRangChoices(models.TextChoices):
    # LAND & AIR
    R_0 = '00', _('')
    R_1 = 'РЯДОВОЙ', _('Рядовой')
    R_2 = 'ЕФРЕЙТОР', _('Ефрейтор')
    R_3 = 'МЛАДШИЙ СЕРЖАНТ', _('Младший сержант')
    R_4 = 'СЕРЖАНТ', _('Сержант')
    R_5 = 'СТАРШИЙ СЕРЖАНТ', _('Старший сержант')
    R_6 = 'СТАРШИНА', _('Старшина')
    R_7 = 'ПРАПОРЩИК', _('Прапорщик')
    R_8 = 'СТАРШИЙ ПРАПОРЩИК', _('Старший прапорщик')
    R_9 = 'МЛАДШИЙ ЛЕЙТЕНАНТ', _('Младший лейтенант')
    R_10 = 'ЛЕЙТЕНАНТ', _('Лейтенант')
    R_11 = 'СТАРШИЙ ЛЕЙТЕНАНТ', _('Старший лейтенант')
    R_12 = 'КАПИТАН', _('Капитан')
    R_13 = 'МАЙОР', _('Майор')
    R_14 = 'ПОДПОЛКОВНИК', _('Подполковник')
    R_15 = 'ПОЛКОВНИК', _('Полковник')
    R_16 = 'ГЕНЕРАЛ-МАЙОР', _('Генерал-майор')
    R_17 = 'ГЕНЕРАЛ-ЛЕЙТЕНАНТ', _('Генерал-лейтенант')
    R_18 = 'ГЕНЕРАЛ-ПОЛКОВНИК', _('Генерал-полковник')
    R_19 = 'ГЕНЕРАЛ АРМИИ', _('Генерал армии')
    R_20 = 'МАРШАЛ РОССИЙСКОЙ ФЕДЕРАЦИИ', _('Маршал Российской Федерации')
    # FLEET
    R_21 = 'МАТРОС', _('Матрос')
    R_22 = 'СТАРШИЙ МАТРОС', _('Старший матрос')
    R_23 = 'СТАРШИНА 2 СТАТЬИ', _('Старшина 2 статьи')
    R_24 = 'СТАРШИНА 1 СТАТЬИ', _('Старшина 1 статьи')
    R_25 = 'ГЛАВНЫЙ СТАРШИНА', _('Главный старшина')
    R_26 = 'ГЛАВНЫЙ КОРАБЕЛЬНЫЙ СТАРШИНА', _('Главный корабельный старшина')
    R_27 = 'МИЧМАН', _('Мичман')
    R_28 = 'СТАРШИЙ МИЧМАН', _('Старший мичман')
    R_32 = 'КАПИТАН-ЛЕЙТЕНАНТ', _('Капитан-лейтенант')
    R_33 = 'КАПИТАН 3 РАНГА', _('Капитан 3 ранга')
    R_34 = 'КАПИТАН 2 РАНГА', _('Капитан 2 ранга')
    R_35 = 'КАПИТАН 1 РАНГА', _('Капитан 1 ранга')
    R_36 = 'КОНТР-АДМИРАЛ', _('Контр-адмирал')
    R_37 = 'ВИЦЕ-АДМИРАЛ', _('Вице-адмирал')
    R_38 = 'АДМИРАЛ"', _('Адмирал"')
    R_39 = 'АДМИРАЛ ФЛОТА', _('Адмирал флота')


class DateMonth(models.TextChoices):
    M_0 = '00', _('')
    JANUARY = '01', _('Січень | Январь')
    FEBRUARY = '02', _('Лютий | Февраль')
    MARCH = '03', _('Березень | Март')
    APRIL = '04', _('Квітень | Апрель')
    MAY = '05', _('Травень | Май')
    JUNE = '06', _('Червень | Июнь')
    JULY = '07', _('Липень | Июль')
    AUGUST = '08', _('Серпень | Август')
    SEPTEMBER = '09', _('Вересень | Сентябрь')
    OCTOBER = '10', _('Жовтень | Октябрь')
    NOVEMBER = '11', _('Листопад | Ноябрь')
    DECEMBER = '12', _('Грудень | Декабрь')


class DateDay(models.TextChoices):
    D_0 = '00', _('')
    D_1 = '01', _('1')
    D_2 = '02', _('2')
    D_3 = '03', _('3')
    D_4 = '04', _('4')
    D_5 = '05', _('5')
    D_6 = '06', _('6')
    D_7 = '07', _('7')
    D_8 = '08', _('8')
    D_9 = '09', _('9')
    D_10 = '10', _('10')
    D_11 = '11', _('11')
    D_12 = '12', _('12')
    D_13 = '13', _('13')
    D_14 = '14', _('14')
    D_15 = '15', _('15')
    D_16 = '16', _('16')
    D_17 = '17', _('17')
    D_18 = '18', _('18')
    D_19 = '19', _('19')
    D_20 = '20', _('20')
    D_21 = '21', _('21')
    D_22 = '22', _('22')
    D_23 = '23', _('23')
    D_24 = '24', _('24')
    D_25 = '25', _('25')
    D_26 = '26', _('26')
    D_27 = '27', _('27')
    D_28 = '28', _('28')
    D_29 = '29', _('29')
    D_30 = '30', _('30')
    D_31 = '31', _('31')
